{
  "id": "cost-effectiveness",
  "url": "manage-database-kubernetes-free",
  "title": "Deploy & Manage Databases in Kubernetes FREE",
  "meta": "KubeDB community edition is FREE to use on any supported Kubernetes enginesYou can deploy and manage your database in Kubernetes FREE",
  "innerContent": [
    {
      "id": 1,
      "title": "Cost-effectiveness",
      "description": "KubeDB community edition is FREE to use on any supported Kubernetes engines. You can deploy and manage your MySQL database in Kubernetes using KubeDB. There is no up-front investment required, and you need to pay only for the resources you use to your infrastructure provider. We offer a 30 days license FREE of cost to try KubeDB Enterprise edition.",
      "img": "https://via.placeholder.com/400/dddddd/808080"
    },
    {
      "id": 2,
      "title": "Reserved instances",
      "description": "Cloud providers like AWS and Azure have the option to reserve virtual machines in advance for 1-3 year terms and provide a significant discount (up to 75% - 80%) compared to on-demand VM pricing. KubeDB operators can provision database instances on reserved instances and significantly reduce your TOC for the DB instances.",
      "img": "https://via.placeholder.com/400/dddddd/808080"
    },
    {
      "id": 3,
      "title": "Halt and Resume",
      "description": "KubeDB allows you to easily halt and resume your database instances. This makes it easy and affordable to use databases for development and test purposes, where the database is not required to be running all of the time.",
      "img": "https://via.placeholder.com/400/dddddd/808080"
    },
    {
      "id": 4,
      "title": "Open Source",
      "description": "KubeDB is an open core project. KubeDB Community edition is open source and free to use for both commercial and non-commercial purposes. It comes with the cluster provisioning functionalities. KubeDB Enterprise edition includes the features of the Community Edition and extends it by automating Day 2 operations like database backup/recovery, upgrading version, horizontal and vertical scaling, TLS/SSL support via cert-manager, updating configuration post provisioning, connection pooling, etc.",
      "img": "https://via.placeholder.com/400/dddddd/808080"
    }
  ]
}
